app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
---
  def index
    @posts = Post.all.order("created_at DESC")

INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('Fuckking finally', 'this took way toooo damn long!', '2016-12-28 22:43:37', '2016-12-28 22:43:37')
---
  def create

  @user = current_user
  @post = Post.new(post_params)

  if @post.save

UPDATE `posts` SET `body` = 'is dope asdl;fajs;dlkf654', `updated_at` = '2016-12-29 00:02:31' WHERE `posts`.`id` = 4
---
def update

   if @post.update(post_params)

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = NULL LIMIT 1
---
def find_post
  @post = Post.find(params[:id])